ЛИС2/src/Catalogs/ЦехаУчастки/ЦехаУчастки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЦехаУчастки</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.ПроизводственныеПлощадки</owners>
</mdclass:Catalog>

ЛИС2/src/Catalogs/Организации/Организации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Организации</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКАТО</name>
    <type>
      <types>CatalogRef.ОКАТО</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКТМО</name>
    <comment>Код по ОКТМО</comment>
    <type>
      <types>CatalogRef.ОКТМО</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <comment>Код по ОКПО</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКОПФ</name>
    <type>
      <types>CatalogRef.ОКОПФ</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОКОПФ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОКВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКодБалансовойЕдиницы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодНалоговогоОргана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодНалоговогоОрганаПолучателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКФС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОКФС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Директор</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОрганаПФР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОрганаФСГС</name>
    <comment>Код органа Федеральной службы государственной статистики</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Полное наименование</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <comment>Юридическое или физическое лицо</comment>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойБанковскийСчет</name>
    <comment>Основной банковский счет</comment>
    <type>
      <types>CatalogRef.Банки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОГРН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКОНХ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КрупнейшийНалогоплательщик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Бухгалтер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерРасчетногоСчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизационноПравоваяФорма</name>
    <type>
      <types>CatalogRef.ОКОПФ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбменКаталогОтправкиДанныхОтчетности</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбменКаталогПрограммыЭлектроннойПочты</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбменКодАбонента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодГУИВ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИностраннаяОрганизация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОКОГУ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОКОГУ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегионыРоссийскойФедерации</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомерПФР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоСерияНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДеятельности</name>
    <type>
      <types>EnumRef.ВидДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОбособленныхПодразделений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбменаСКонтролирующимиОрганами</name>
    <type>
      <types>EnumRef.УдалитьВидыОбменаСКонтролирующимиОрганами</types>
      <types>EnumRef.ВидыОбменаСКонтролирующимиОрганами</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗаписьОбмена</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиДокументооборота</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДеятельностиОрганизации</name>
    <comment>Для определения норматива платы для отходов 5 класса </comment>
    <type>
      <types>CatalogRef.ВидыДеятельностиОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакПроизводителяТоваров</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакИмпортераТоваров</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>EnumRef.РазмерИЧисленностьОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕГРЮЛ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВнесенияВЕГРЮЛ</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрацииПриродопользователя</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>удалитьКРК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ЛИС2/src/Catalogs/ЦехаУчастки/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ОбщегоНазначения.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
	СформироватьДеревоПодчинения();
	
	Если Параметры.Отбор.Свойство("Владелец") Тогда
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
	    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	    ЭлементОтбора.Использование = Истина;
	    ЭлементОтбора.ПравоеЗначение = Параметры.Отбор.Владелец;
		
		Элементы.ПлощадкиСписок.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПлощадкиСписокПриАктивизацииСтроки(Элемент)
	
	Если Элементы.ПлощадкиСписок.ТекущиеДанные.Вид = "Площадка" Тогда
		ПлощадкаОтбора = ОпределитьТекущуюПлощадкуСписка();
		Если ПлощадкаОтбора = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Владелец", ПлощадкаОтбора, , , Ложь);
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Владелец", ПлощадкаОтбора, , , Истина);
		КонецЕсли;
	ИначеЕсли Элементы.ПлощадкиСписок.ТекущиеДанные.Вид = "Организация" Тогда
		ПлощадкиОтбора = ОпределитьПодчиненныеПлощадкиСписка();
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Владелец", ПлощадкиОтбора, ВидСравненияКомпоновкиДанных.ВСписке, , Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ОпределитьТекущуюПлощадкуСписка()
	
	ПлощадкаОтбора = Неопределено;
	
	ТекущиеДанные = Элементы.ПлощадкиСписок.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда 
		ПлощадкаОтбора = ТекущиеДанные.Наименование;
	КонецЕсли;
	
	Возврат ПлощадкаОтбора;
	
КонецФункции

&НаКлиенте
Функция ОпределитьПодчиненныеПлощадкиСписка()
	
	ТекущиеДанные = Элементы.ПлощадкиСписок.ТекущиеДанные;
	СписокПодчиненныхЭлементов = ТекущиеДанные.ПолучитьЭлементы();
	
	ПлощадкиОтбора = Новый СписокЗначений;
	ПлощадкиОтбора = ЗаполнитьПлощадкиОтбора(СписокПодчиненныхЭлементов, ПлощадкиОтбора);
			
	Возврат ПлощадкиОтбора;
	
КонецФункции

&НаКлиенте
Функция ЗаполнитьПлощадкиОтбора(СписокПодчиненныхЭлементов, ПлощадкиОтбора)
	
	Для Каждого ПодчиненныйЭлемент Из СписокПодчиненныхЭлементов Цикл
		пЭлементы = ПодчиненныйЭлемент.ПолучитьЭлементы();
		Если ПодчиненныйЭлемент.Вид = "Площадка" Тогда
			ПлощадкиОтбора.Добавить(ПодчиненныйЭлемент.Наименование);
		КонецЕсли;
		Если НЕ пЭлементы.Количество() = 0 Тогда
			ЗаполнитьПлощадкиОтбора(пЭлементы, ПлощадкиОтбора);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПлощадкиОтбора;
	
КонецФункции

&НаСервере
Процедура СформироватьДеревоПодчинения()
	
	ИсходноеДерево = Новый ДеревоЗначений;
	ИсходноеДерево.Колонки.Добавить("Наименование");
	ИсходноеДерево.Колонки.Добавить("Вид");
	ИсходноеДерево.Колонки.Добавить("Использование");
	
	ВерхнийУровень = ИсходноеДерево.Строки.Добавить();
	ВерхнийУровень.Наименование = "Все организации";
	ВерхнийУровень.Вид = "Организация";
	ВерхнийУровень.Использование = Истина;
	
	ВерхнийУровеньСтроки = ВерхнийУровень.Строки;
	
	Запрос = Новый Запрос(
	 "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	 |	Организации.Ссылка КАК Ссылка,
	 |	Организации.Родитель КАК Родитель
	 |ИЗ
	 |	Справочник.Организации КАК Организации
	 |
	 |УПОРЯДОЧИТЬ ПО
	 |	Ссылка ИЕРАРХИЯ");
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.Прямой);
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.Родитель) Тогда
			
			Родитель = ВерхнийУровень;
			
		Иначе
			
			Родитель = ВерхнийУровеньСтроки.Найти(Выборка.Родитель, "Наименование", Истина);
			
		КонецЕсли;	
		
		Если Родитель = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Родитель.Строки.Добавить();
		НоваяСтрока.Наименование = Выборка.Ссылка;
		НоваяСтрока.Вид = "Организация";
		НоваяСтрока.Использование = Истина;
		
	КонецЦикла;
	
	Запрос = Новый Запрос(
	 "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	 |	ПроизводственныеПлощадки.Ссылка КАК Ссылка,
	 |	ПроизводственныеПлощадки.Владелец КАК Владелец
	 |ИЗ
	 |	Справочник.ПроизводственныеПлощадки КАК ПроизводственныеПлощадки");
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.Прямой);
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.Владелец) Тогда
			
			Родитель = Неопределено;
			
		Иначе
			
			Родитель = ВерхнийУровеньСтроки.Найти(Выборка.Владелец, "Наименование", Истина);
			
		КонецЕсли;	
		
		Если Родитель = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Родитель.Строки.Добавить();
		НоваяСтрока.Наименование = Выборка.Ссылка;
		НоваяСтрока.Вид = "Площадка";
		НоваяСтрока.Использование = Истина;
		
	КонецЦикла;
	 	
	ЗначениеВРеквизитФормы(ИсходноеДерево, "ДеревоПодчинения");
	
КонецПроцедуры

#КонецОбласти
